insert into team values
(1, 'Сергей', 'Иванович', 'Дементьев', '1977-02-02', 'СпбГУ', 1020304050, '123-123-123 12', '123456789123', 'dementyev@yandex.ru'),
(2, 'Игорь', 'Андреевич', 'Игошин', '1991-03-14', 'УрФУ', 1020304051, '123-123-123 13', '123456789124', 'igoshin@inbox.ru'),
(3, 'Мария', 'Дмитриевна', 'Саакян', '1956-12-13', 'МГУ им. М.В. Ломоносова', 1020304052, '123-123-123 14', '123456789125', 'saakyan@yandex.ru'),
(4, 'Ольга', 'Евгеньевна', 'Добрякова', '1986-11-30', 'ЛГУ', 1020304053, '123-123-123 15', '123456789126', 'dobryakova@yandex.ru'),
(5, 'Андрей', 'Ильич', 'Емельянов', '1969-11-11', 'ГГПИ им. В.Г. Короленко', 1020304054, '123-123-123 16', '123456789127', 'emelyanov@yandex.ru'),
(6, 'Роман', 'Ревович', 'Азиатцев', '1992-01-17', 'ГГПИ им. В.Г. Короленко', 1020304055, '123-123-123 17', '123456789128', 'roman_r@mail.ru'),
(7, 'Ангелина', 'Артуровна', 'Малахова', '1980-04-01', 'КНИТУ', 1020304056, '123-123-123 18', '123456789129', 'malahova@mail.ru'),
(8, 'Наталия', 'Алексеевна', 'Пушкарская', '1968-07-19', 'МГУ им. М.В. Ломоносова', 1020304057, '123-123-123 19', '123456789130', 'nataliya_p@mail.ru'),
(9, 'Илья', 'Самирович', 'Амадов', '1982-10-03', 'ИжГТУ', 1020304058, '123-123-123 20', '123456789131', 'ilya_amadov@yandex.ru'),
(10, 'Анна', 'Александровна', 'Лучинская', '1989-12-09', 'УрФУ', 1020304059, '123-123-123 21', '123456789132', 'anna_lu@yandex.ru')

insert into administration values
(3, 'Зам. директора по УВР', 40, 1020304052, 89990001112),
(5, 'Директор', 28, 1020304054, 89990001100),
(7, 'Зам. директора по безопаности', 19, 1020304056, 89990001134)

insert into teachers values 
(1, 'Учитель математики', 20, 1020304050, 12345612345),
(2, 'Учитель истории', 6, 1020304051, 12345612340),
(4, 'Учитель ОБЖ', 11, 1020304053, 12345612389),
(6, 'Учитель русского языка и литературы', 4, 1020304055, 12345612382),
(8, 'Учитель физической культуры', 25, 1020304057, 12345612410),
(9, 'Учитель информатики', 12, 1020304058, 12345612416),
(10, 'Учитель информатики', 8, 1020304059, 12345615691)

insert into school_classes values 
(1, '1 А'), (2, '2 Б'), (3, '3 В'), (4, '4 Г'), (5, '5 Д'),
(6, '6 Г'), (7, '7 В'), (8, '8 А'), (9, '9 Б'), (10, '10 А')

insert into pupils values 
(1, 'Андрей', 'Юрьевич', 'Смольников', '2010-01-01', 6, '000-000-000 00'),
(2, 'Ирина', 'Олеговна', 'Дурова', '2006-12-07', 10, '000-000-000 01'),
(3, 'Максим', 'Михайлович', 'Попов', '2006-08-14', 10, '000-000-000 02'),
(4, 'Елена', 'Андреевна', 'Иванова', '2009-03-24', 7, '000-000-000 03'),
(5, 'Кутман', 'Аркадьевич', 'Лавров', '2015-01-10', 1, '000-000-000 04'),
(6, 'Владислав', 'Игоревич', 'Хохлов', '2014-02-12', 2, '000-000-000 05'),
(7, 'Алёна', 'Ивановна', 'Вайнерман', '2011-06-10', 5, '000-000-000 06'),
(8, 'Мадина', 'Омаровна', 'Курбанова', '2007-05-30', 9, '000-000-000 07'),
(9, 'Михаил', 'Сергеевич', 'Новиков', '2012-03-03', 4, '000-000-000 08'),
(10, 'Пётр', 'Владимирович', 'Шумов', '2008-09-16', 8, '000-000-000 09')

insert into class_teachers values 
(1, 10), (2, 1), (3, 9), (4, 2), (6, 8), (7, 7), (8, 4), (9, 5), (10, 6)

insert into parents values 
(1, 'Иван', 'Павлович', 'Альтман', '1977-01-14', '111-111-111-00', 12121212120),
(2, 'Юрий', 'Семёнович', 'Смольников', '1976-10-03', '111-111-111-01', 12121212121),
(3, 'Лариса', 'Петровна', 'Лаврова', '1991-11-08', '111-111-111-02', 12121212122),
(4, 'Анастасия', 'Сергеевна', 'Новикова', '1989-06-01', '111-111-111-03', 12121212123),
(5, 'Владимир', 'Алексеевич', 'Шумов', '1985-01-15', '111-111-111-04', 12121212124),
(6, 'Игорь', 'Иванович', 'Хохлов', '1985-01-15', '111-111-111-05', 12121212125),
(7, 'Андрей', 'Петрович', 'Иванов', '1980-02-18', '111-111-111-06', 12121212126)

insert into relation values 
(1, 2), (5, 3), (9, 4), (10, 5), (6, 6), (4, 7), 
(2, 2), (3, 7)

insert into school_subjects values 
(1, 'История'), (2, 'Русский язык'), (3, 'Математика'),
(4, 'ОБЖ'), (5, 'Физика'), (6, 'Химия'),
(7, 'Английский язык'), (8, 'Биология')

insert into schoolbooks values 
(1, 3, 'Математика. Базовый уровень. 6 класс', 'А.Н. Никифоров, Б.Ю. Шпиц', 6), 
(2, 3, 'Математика. Базовый уровень. 10 класс', 'А.Н. Никифоров, А.Е. Версталина', 10), 
(3, 1, 'История России. XIX век.', 'А. Д. Фёдоров, А.Н. Торкунов',9), 
(4, 2, 'Русский язык', 'А. К. Иванов, А. Е. Однорог', 7), 
(5, 6, 'Химия. Базовый уровень', 'Б.И. Кресс', 8), 
(6, 8, 'Биология', 'В.В. Шилов', 5)

insert into classrooms values 
(1, 1, 432, 'Кабинет математики'), (2, 2, 107, 'Кабинет начальных классов'),
(3, 6, 425, 'Кабинет русского языка'), (4, 9, 255, 'Кабинет информатики'),
(5, 10, 430, 'Кабинет информатики'), (6, 4, 103, 'Кабинет начальных классов')



























